app/controllers/api/v1/authentication_controller.rb

      def login
        # Debug logging
        Rails.logger.debug "Raw params: #{params.inspect}"

        # Estrai i parametri corretti
        auth_params = if params[:authentication] && params[:authentication][:user]
          params[:authentication][:user]
        else
          login_params  # Use the login_params method to get user data
        end

        Rails.logger.debug "Auth params: #{auth_params.inspect}"

        email = auth_params[:email]
        password = auth_params[:password]

        Rails.logger.debug "Attempting login with email: #{email}"

        @user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]