app/controllers/api/v1/users_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "surname", "username", "date_of_birth", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create
        @user = User.new(user_params)

        if User.exists?(email: @user.email)
          render json: { error: 'Email già utilizzata.' }, status: :unprocessable_entity
          return
        end

        if User.exists?(username: @user.username)
          render json: { error: 'Username già utilizzato.' }, status: :unprocessable_entity
          return
        end

        if @user.save